; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-4-3-6)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 robot4 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 rgripper4 lgripper4 - gripper
room1 room2 room3 - room
ball1 ball2 ball3 ball4 ball5 ball6 - object)
(:init
(at-robby robot1 room2)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room3)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room2)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at-robby robot4 room2)
(free robot4 rgripper4)
(free robot4 lgripper4)
(at ball1 room3)
(at ball2 room1)
(at ball3 room1)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
)
(:goal
(and
(at ball1 room1)
(at ball2 room1)
(at ball3 room1)
(at ball4 room3)
(at ball5 room2)
(at ball6 room3)
)
)
)

; plan
1. (pick robot2 ball5 room3 lgripper2)
   deleted: (at ball5 room3) (free robot2 lgripper2)
   added: (carry robot2 ball5 lgripper2)
   goals met: 4 of 6
2. (pick robot2 ball1 room3 rgripper2)
   deleted: (at ball1 room3) (free robot2 rgripper2)
   added: (carry robot2 ball1 rgripper2)
   goals met: 4 of 6
3. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 4 of 6
4. (drop robot2 ball5 room2 lgripper2)
   deleted: (carry robot2 ball5 lgripper2)
   added: (at ball5 room2) (free robot2 lgripper2)
   goals met: 5 of 6
5. (move robot2 room2 room1)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room1)
   goals met: 5 of 6
6. (drop robot2 ball1 room1 rgripper2)
   deleted: (carry robot2 ball1 rgripper2)
   added: (at ball1 room1) (free robot2 rgripper2)
   goals met: 6 of 6
